Catalogs/бит_ПользовательскиеМакетыПечати.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ПользовательскиеМакетыПечати</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяКаталога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяМакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаОбластей</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаПараметров</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПроизвольныеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодИнициализации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоТаблица</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Назначение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПолноеИмяОбъектаМетаданных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/бит_ПользовательскиеМакетыПечати/Forms/РедактированиеМакета/Ext/Form/Module.bsl
#Область ПеременныеМодуля

&НаКлиенте
Перем СОМОбъект Экспорт; // СОМ Объект.

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ИдентификаторФормы = Параметры.ИдентификаторФормы;
	
	АдресФайлаМакетаВоВременномХранилище = Параметры.АдресФайлаМакетаВоВременномХранилище;
	ИмяМакета = Параметры.ИмяМакета;
	
	ТипМакета = Параметры.ТипМакета;
	
	//ПредставлениеМакета = ПредставлениеМакета();
	//ИмяФайлаМакета = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ПредставлениеМакета) + "." + НРег(ТипМакета);
	
	ИмяФайлаМакета = Параметры.ИмяФайлаМакета;
	
	Если Параметры.ТолькоОткрытие Тогда
		Заголовок = НСтр("ru = 'Открытие макета печатной формы'");
	Иначе
		АдресТаблицыОбластейВоВременномХранилище   = Параметры.АдресТаблицыОбластейВоВременномХранилище;
		АдресТаблицыПараметровВоВременномХранилище = Параметры.АдресТаблицыПараметровВоВременномХранилище;
		РаспаковатьТаблицы();
	КонецЕсли;
	
	ТипКлиента = ?(Параметры.ЭтоВебКлиент, "", "Не") + "ВебКлиент";
	КлючСохраненияПоложенияОкна = ТипКлиента + ВРег(ТипМакета);
	
	Для каждого ЭлементНазначения Из Параметры.СписокНазначений Цикл
		
		НоваяСтрока = Назначения.Добавить();
		НоваяСтрока.ПолноеИмяОбъектаМетаданных = ЭлементНазначения.Значение;
		НоваяСтрока.Представление              = ЭлементНазначения.Представление;
		
	КонецЦикла;
	
	Для каждого ЭлементПП Из Параметры.СписокПроизвольныхПараметров Цикл
		
		НоваяСтрока = ПроизовольныеПараметры.Добавить();
		НоваяСтрока.ИмяПараметра = ЭлементПП.Значение;
		
	КонецЦикла;
	//Если Не Параметры.ЭтоВебКлиент И ТипМакета = "MXL" Тогда
	//	Элементы.НадписьЗавершениеИзмененияНеВебКлиент.Заголовок = НСтр(
	//		"ru = 'После внесения необходимых изменений в макет нажмите на кнопку ""Завершить изменение""'");
	//КонецЕсли;
	
	
	
	УстановитьНазваниеПрограммыДляОткрытияМакета();
	
	Элементы.Диалог.ТекущаяСтраница = Элементы["СтраницаЗагрузкаНаКомпьютер" + ТипКлиента];
	Элементы.КоманднаяПанель.ТекущаяСтраница = Элементы.ПанельЗагрузка;
	Элементы.КнопкаИзменить.КнопкаПоУмолчанию = Истина;
	
	ДеревоОбъектовМетаданныхЗаполнить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	#Если Не ВебКлиент Тогда
		Если Параметры.ТолькоОткрытие Тогда
			Отказ = Истина;
		КонецЕсли;
		Если Параметры.ТолькоОткрытие Или ТипМакета = "MXL" Тогда
			ОткрытьМакет();
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// БИТ_ЖКХ 09.09.2016 11:55:28 Начало правки...
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	// БИТ_ЖКХ 09.09.2016 11:55:28 Конец правки.
	
	Если Не ПустаяСтрока(ВременнаяПапка) Тогда
		УдалитьФайлы(ВременнаяПапка);
	КонецЕсли;
	
	ИмяСобытия = "ОтказОтИзмененияМакета";
	Если МакетЗагружен Тогда
		ИмяСобытия = "Запись_ПользовательскиеМакетыПечати";
	КонецЕсли;
	
	Результат = Новый Структура();
	Результат.Вставить("АдресФайлаМакетаВоВременномХранилище"      , АдресФайлаМакетаВоВременномХранилище);
	Результат.Вставить("АдресТаблицыОбластейВоВременномХранилище"  , АдресТаблицыОбластейВоВременномХранилище);
	Результат.Вставить("АдресТаблицыПараметровВоВременномХранилище", АдресТаблицыПараметровВоВременномХранилище);
	
	Оповестить(ИмяСобытия, Результат, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СсылкаНаСтраницуПрограммыНажатие(Элемент)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда

	#Иначе
		ПерейтиПоНавигационнойСсылке(АдресПрограммыДляОткрытияМакета);
	#КонецЕсли 
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура Изменить(Команда)
	ОткрытьМакет();
	Если Параметры.ТолькоОткрытие Тогда
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьИзменение(Команда)
	
	//#Если Вебклиент Тогда
	//	МакетЗагружен = ПоместитьФайл(АдресФайлаМакетаВоВременномХранилище, ИмяФайлаМакета);
	//#Иначе
	//	Если НРег(ТипМакета) = "mxl" Тогда
	//		ИзменяемыйМакет.Скрыть();
	//		//ИзменяемыйМакет.Записать(ПутьКФайлуМакета);
	//		АдресФайлаМакетаВоВременномХранилище = ПоместитьВоВременноеХранилище(ИзменяемыйМакет);
	//		МакетЗагружен = Истина;
	//	Иначе
	ЗакрытьCOMОбъект();
	
	Файл = Новый Файл(ПутьКФайлуМакета);
	Если Файл.Существует() Тогда
		
		ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКФайлуМакета);
		АдресФайлаМакетаВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, ИдентификаторФормы);
		МакетЗагружен = Истина;
		
	КонецЕсли;
	
	ЗапаковатьТаблицы();
	//	КонецЕсли;
	//#КонецЕсли
	
	//Если МакетЗагружен Тогда
	//	ЗаписатьМакет();
	//КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УдалитьПоСтроке(ИД)
	
	Отбор = Новый Структура("ИД", ИД);
	МассивСтрок = ТаблицаПараметров.НайтиСтроки(Отбор);
	
	Для каждого СтрокаТабличнойЧасти Из МассивСтрок Цикл
		ТаблицаПараметров.Удалить(СтрокаТабличнойЧасти);
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНазваниеПрограммыДляОткрытияМакета()
	
	НазваниеПрограммыДляОткрытияМакета = "";
	
	ТипФайла = НРег(ТипМакета);
	Если ТипФайла = "mxl" Тогда
		НазваниеПрограммыДляОткрытияМакета = НСтр("ru = '1С:Предприятие - Работа с файлами'");
		ТипПриложения="1С";
		АдресПрограммыДляОткрытияМакета = "http://v8.1c.ru/metod/fileworkshop.htm";
	ИначеЕсли ТипФайла = "doc" ИЛИ ТипФайла = "docx" ИЛИ ТипФайла = "rtf" Тогда
		ТипПриложения="Word.Application";
		НазваниеПрограммыДляОткрытияМакета = НСтр("ru = 'Microsoft Word'");
		АдресПрограммыДляОткрытияМакета = "http://office.microsoft.com/ru-ru/word";
	ИначеЕсли ТипФайла = "odt" Тогда
		ТипПриложения="TOpenOffice.Writer";
		НазваниеПрограммыДляОткрытияМакета = НСтр("ru = 'OpenOffice Writer'");
		АдресПрограммыДляОткрытияМакета = "http://www.openoffice.org/product/writer.html";
	КонецЕсли;
	
	СведенияДляЗаполнения = Новый Структура;
	СведенияДляЗаполнения.Вставить("ИмяМакета"        , ИмяМакета);
	СведенияДляЗаполнения.Вставить("НазваниеПрограммы", НазваниеПрограммыДляОткрытияМакета);
	СведенияДляЗаполнения.Вставить("ОписаниеДействия" , ?(Параметры.ТолькоОткрытие, НСтр("ru = 'открытия'"), НСтр("ru = 'внесения изменений'")));
	
	ЗаполняемыеЭлементы = Новый Массив;
	ЗаполняемыеЭлементы.Добавить(Элементы.СсылкаНаСтраницуПрограммыПередЗагрузкойВебКлиент);
	ЗаполняемыеЭлементы.Добавить(Элементы.СсылкаНаСтраницуПрограммыПередЗагрузкойНеВебКлиент);
	ЗаполняемыеЭлементы.Добавить(Элементы.СсылкаНаСтраницуПрограммыЗавершениеИзмененияВебКлиент);
	ЗаполняемыеЭлементы.Добавить(Элементы.СсылкаНаСтраницуПрограммыЗавершениеИзмененияНеВебКлиент);
	ЗаполняемыеЭлементы.Добавить(Элементы.НадписьПередЗагрузкойМакетаПрограммаВебКлиент);
	ЗаполняемыеЭлементы.Добавить(Элементы.НадписьПередЗагрузкойМакетаПрограммаНеВебКлиент);
	ЗаполняемыеЭлементы.Добавить(Элементы.НадписьЗавершениеИзмененияВебКлиент);
	ЗаполняемыеЭлементы.Добавить(Элементы.НадписьЗавершениеИзмененияНеВебКлиент);
	
	Для Каждого Элемент Из ЗаполняемыеЭлементы Цикл
		Элемент.Заголовок = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Элемент.Заголовок, СведенияДляЗаполнения);
	КонецЦикла;
	
	ВидимостьСсылкиНаСтраницуПрограммы = Параметры.ЭтоВебКлиент Или ТипФайла <> "mxl";
	Элементы.СсылкаНаСтраницуПрограммыПередЗагрузкойВебКлиент.Видимость = ВидимостьСсылкиНаСтраницуПрограммы;
	Элементы.СсылкаНаСтраницуПрограммыПередЗагрузкойНеВебКлиент.Видимость = ВидимостьСсылкиНаСтраницуПрограммы;
	Элементы.СсылкаНаСтраницуПрограммыЗавершениеИзмененияВебКлиент.Видимость = ВидимостьСсылкиНаСтраницуПрограммы;
	Элементы.СсылкаНаСтраницуПрограммыЗавершениеИзмененияНеВебКлиент.Видимость = ВидимостьСсылкиНаСтраницуПрограммы;
	
	Элементы.НадписьПередЗагрузкойМакетаПрограммаНеВебКлиент.Видимость = ТипФайла <> "mxl";
	
	Элементы.СтраницаЗагрузкаНаКомпьютерВебКлиент.Видимость = Параметры.ЭтоВебКлиент;
	Элементы.СтраницаЗагрузкаВИнформационнуюБазуВебКлиент.Видимость = Параметры.ЭтоВебКлиент;
	Элементы.СтраницаЗагрузкаНаКомпьютерНеВебКлиент.Видимость = Не Параметры.ЭтоВебКлиент;
	Элементы.СтраницаЗагрузкаВИнформационнуюБазуНеВебКлиент.Видимость = Не Параметры.ЭтоВебКлиент;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьМакет()
	#Если ВебКлиент Тогда
		ОткрытьМакетВебКлиент();
	#Иначе
		ОткрытьМакетТонкийКлиент();
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьМакетТонкийКлиент()
	
	#Если Не ВебКлиент Тогда
		
		Макет = ПолучитьИзВременногоХранилища(АдресФайлаМакетаВоВременномХранилище);
		ВременнаяПапка = ПолучитьИмяВременногоФайла();
		СоздатьКаталог(ВременнаяПапка);
		ПутьКФайлуМакета = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ВременнаяПапка) + ИмяФайлаМакета;
		
		//Если ТипМакета = "MXL" Тогда
		//	Если Параметры.ТолькоОткрытие Тогда
		//		Макет.ТолькоПросмотр = Истина;
		//		Макет.Показать(ПредставлениеМакета,,Истина);
		//	Иначе
		//		Макет.Записать(ПутьКФайлуМакета);
		//		Макет.Показать(ПредставлениеМакета, ПутьКФайлуМакета, Истина);
		//		
		//		ИзменяемыйМакет = Макет;
		//	КонецЕсли;
		//Иначе
			Макет.Записать(ПутьКФайлуМакета);
			Если Параметры.ТолькоОткрытие Тогда
				ФайлМакета = Новый Файл(ПутьКФайлуМакета);
				ФайлМакета.УстановитьТолькоЧтение(Истина);
				ЗапуститьПриложение(ПутьКФайлуМакета);
			Иначе
				СоздатьCOMОбъект();
			КонецЕсли;
			
		//КонецЕсли;
		
		ПерейтиНаСтраницуЗавершенияИзменения();
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьМакетВебКлиент()
	Если ПолучитьФайл(ПоместитьМакетВоВременноеХранилище(), ИмяФайлаМакета) <> Ложь Тогда
		ПерейтиНаСтраницуЗавершенияИзменения();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПоместитьМакетВоВременноеХранилище()
	
	Возврат ПоместитьВоВременноеХранилище(ДвоичныеДанныеМакета());
	
КонецФункции

&НаСервере
Функция ДвоичныеДанныеМакета()
	
	ДанныеМакета = ПолучитьИзВременногоХранилища(АдресФайлаМакетаВоВременномХранилище);
	
	Возврат ДанныеМакета;
	
КонецФункции

&НаКлиенте
Процедура ПерейтиНаСтраницуЗавершенияИзменения()
	Элементы.Диалог.ТекущаяСтраница = Элементы["СтраницаЗагрузкаВИнформационнуюБазу" + ТипКлиента];
	Элементы.КоманднаяПанель.ТекущаяСтраница = Элементы.ПанельЗавершениеИзменения;
	Элементы.КнопкаЗавершитьИзменение.КнопкаПоУмолчанию = Истина;
КонецПроцедуры

// Процедура заполняет дерево значений объектов конфигурации.
// Если список значений "Параметры.КоллекцииВыбираемыхОбъектовМетаданных" не пуст, тогда
// дерево будет ограничено переданным списком коллекций объектов метаданных.
//  Если объекты метаданных в сформированном дереве будут найдены в списке значений
// "Параметры.ВыбранныеОбъектыМетаданных", тогда они будут помечены, как выбранные.
//
&НаСервере
Процедура ДеревоОбъектовМетаданныхЗаполнить()
	
	КоллекцияРеквизитов = Новый Структура;
	
	Для каждого ЭлементНазначения Из Назначения Цикл
		
		ИмяОбъекта = СтрЗаменить(ЭлементНазначения.Представление, " ", "_");
		
		ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ЭлементНазначения.ПолноеИмяОбъектаМетаданных);
		Если ОбъектМетаданных = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыЭлемента = ПараметрыЭлементаДереваОбъектовМетаданных();
		ПараметрыЭлемента.Имя           = ЭлементНазначения.ПолноеИмяОбъектаМетаданных;
		ПараметрыЭлемента.Представление = ЭлементНазначения.Представление;
		ПараметрыЭлемента.Картинка      = БиблиотекаКартинок.Документ;
		ПараметрыЭлемента.Тип           = "Документ";
		
		ДобавитьРеквизитыДереваОбъектовМетаданных(ОбъектМетаданных, ПараметрыЭлемента);
		
		КоллекцияРеквизитов.Вставить(ИмяОбъекта, ПараметрыЭлемента);
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
// БИТ_ЖКХ Процедура 
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ДобавитьРеквизитыДереваОбъектовМетаданных(ОбъектМетаданных, Родитель)
	
	Реквизиты = Родитель.Реквизиты;
	
	ЭтоДокумент = Метаданные.Документы.Содержит(ОбъектМетаданных);
	
	// Добавление стандартных реквизитов
	Если ЭтоДокумент Тогда
		
		РеквизитДата = ОбъектМетаданных.СтандартныеРеквизиты["Дата"];
		
		ПараметрыЭлемента = ПараметрыЭлементаДереваОбъектовМетаданных();
		ПараметрыЭлемента.Имя           = РеквизитДата.Имя;
		ПараметрыЭлемента.Представление = РеквизитДата.Синоним;
		ПараметрыЭлемента.ТипЗначения   = РеквизитДата.Тип;
		ПараметрыЭлемента.Картинка      = БиблиотекаКартинок.бит_Реквизит;
		ПараметрыЭлемента.Тип           = "Поле";
		
		Реквизиты.Вставить(РеквизитДата.Имя, ПараметрыЭлемента);
		
		РеквизитНомер = ОбъектМетаданных.СтандартныеРеквизиты["Номер"];
		
		ПараметрыЭлемента = ПараметрыЭлементаДереваОбъектовМетаданных();
		ПараметрыЭлемента.Имя           = РеквизитНомер.Имя;
		ПараметрыЭлемента.Представление = РеквизитНомер.Синоним;
		ПараметрыЭлемента.ТипЗначения   = РеквизитНомер.Тип;
		ПараметрыЭлемента.Тип           = "Поле";
		ПараметрыЭлемента.Картинка      = БиблиотекаКартинок.бит_Реквизит;
		Реквизиты.Вставить(РеквизитНомер.Имя, ПараметрыЭлемента);
		
	Иначе
		
		РеквизитКод = ОбъектМетаданных.СтандартныеРеквизиты["Код"];
		
		ПараметрыЭлемента = ПараметрыЭлементаДереваОбъектовМетаданных();
		ПараметрыЭлемента.Имя           = РеквизитКод.Имя;
		ПараметрыЭлемента.Представление = РеквизитКод.Синоним;
		ПараметрыЭлемента.ТипЗначения   = РеквизитКод.Тип;
		ПараметрыЭлемента.Тип           = "Поле";
		ПараметрыЭлемента.Картинка      = БиблиотекаКартинок.бит_Реквизит;
		Реквизиты.Вставить(РеквизитНомер.Имя, ПараметрыЭлемента);
		
	КонецЕсли; 
	
	// Добавление реквизитов
	Для каждого РеквизитОбъекта Из ОбъектМетаданных.Реквизиты Цикл
		
		ПараметрыЭлемента = ПараметрыЭлементаДереваОбъектовМетаданных();
		ПараметрыЭлемента.Имя           = РеквизитОбъекта.Имя;
		ПараметрыЭлемента.Представление = РеквизитОбъекта.Синоним;
		ПараметрыЭлемента.ТипЗначения   = РеквизитОбъекта.Тип;
		ПараметрыЭлемента.Тип           = "Поле";
		ПараметрыЭлемента.Картинка      = БиблиотекаКартинок.бит_Реквизит;
		Реквизиты.Вставить(РеквизитОбъекта.Имя, ПараметрыЭлемента);
		
	КонецЦикла;
	
	// Добавление Табличных частей
	КоллекцияТабличныхЧастей = ОбъектМетаданных.ТабличныеЧасти;
	
	Для каждого ТабличнаяЧасть Из КоллекцияТабличныхЧастей Цикл
		
		СписокТабличныхЧастей.Добавить(ТабличнаяЧасть.Имя, ТабличнаяЧасть.Синоним);
		
		ПараметрыТабЧасти = ПараметрыЭлементаДереваОбъектовМетаданных();
		ПараметрыТабЧасти.Имя           = ТабличнаяЧасть.Имя;
		ПараметрыТабЧасти.Представление = ТабличнаяЧасть.Синоним;
		ПараметрыТабЧасти.ТипЗначения   = Новый ОписаниеТипов("ТаблицаЗначений");
		ПараметрыТабЧасти.Тип           = "ТаблицаЗначений";
		ПараметрыТабЧасти.Картинка      = БиблиотекаКартинок.бит_ТабличнаяЧасть;
		
		РеквизитыТабЧасти = ПараметрыТабЧасти.Реквизиты;
		
		КоллекцияРеквизитовТабЧасти = ТабличнаяЧасть.Реквизиты;
		
		Для каждого РеквизитТабЧасти Из КоллекцияРеквизитовТабЧасти Цикл
			
			ПараметрыЭлемента = ПараметрыЭлементаДереваОбъектовМетаданных();
			ПараметрыЭлемента.Имя           = РеквизитТабЧасти.Имя;
			ПараметрыЭлемента.Представление = РеквизитТабЧасти.Синоним;
			ПараметрыЭлемента.ТипЗначения   = РеквизитТабЧасти.Тип;
			ПараметрыЭлемента.Тип           = "ПолеТаблицыЗначений";
			ПараметрыЭлемента.Картинка      = БиблиотекаКартинок.бит_Реквизит;
			РеквизитыТабЧасти.Вставить(РеквизитТабЧасти.Имя, ПараметрыЭлемента);
			
		КонецЦикла; 
		
		Реквизиты.Вставить(ТабличнаяЧасть.Имя, ПараметрыТабЧасти);
		
	КонецЦикла; 
	
	Если ПроизовольныеПараметры.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПП = ПараметрыЭлементаДереваОбъектовМетаданных();
	ПараметрыПП.Имя           = "ПроизвольныеПараметры";
	ПараметрыПП.Представление = "Произвольные параметры";
	ПараметрыПП.Тип           = "Список";
	ПараметрыПП.Картинка      = БиблиотекаКартинок.бит_ДополнительныеРеквизиты;
	
	Для каждого ЭлементПП Из ПроизовольныеПараметры Цикл
		
		ПараметрыЭлемента = ПараметрыЭлементаДереваОбъектовМетаданных();
		ПараметрыЭлемента.Имя           = ЭлементПП.ИмяПараметра;
		ПараметрыЭлемента.Представление = ЭлементПП.ИмяПараметра;
		ПараметрыЭлемента.Тип           = "ПолеСписка";
		ПараметрыЭлемента.Картинка      = БиблиотекаКартинок.бит_Реквизит;
		ПараметрыПП.Реквизиты.Вставить(ЭлементПП.ИмяПараметра, ПараметрыЭлемента);
		
	КонецЦикла;
	
	Реквизиты.Вставить(ПараметрыПП.Имя, ПараметрыПП);
	
КонецПроцедуры // () 

&НаКлиентеНаСервереБезКонтекста
// Возвращает новую структуру параметров элемента дерева объектов метаданных.
//
// Возвращаемое значение:
//   Структура с полями:
//     Имя           - Строка - имя родительского элемента,
//     Синоним       - Строка - синоним родительского элемента,
//     Пометка       - Булево - начальная пометка коллекции или объекта метаданных,
//     Картинка      - Число - код картинки родительского элемента,
//     КартинкаОбъекта - Число - код картинки подэлемента,
//     Родитель        - ссылка на элемента дерева значений, который является корнем,
//                       для добавляемого элемента.
//
Функция ПараметрыЭлементаДереваОбъектовМетаданных()
	
	Возврат Новый Структура("Имя,Представление,ТипЗначения,Тип,Картинка,Реквизиты,Родитель", "", "", Новый ОписаниеТипов,"", 0, Новый Структура, Неопределено);
	
КонецФункции

#КонецОбласти

#Область УправлениеСОМобъектом

&НаКлиенте
// БИТ_ЖКХ Процедура 
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура СоздатьCOMОбъект()
	
	Попытка
		
		СОМОбъект = Новый COMОбъект(ТипПриложения);
		СОМОбъект.Documents.Open(ПутьКФайлуМакета);
		СОМОбъект.Selection.HomeKey(6);
		СОМОбъект.Visible = 1;
		СОМОбъект.Activate();
		
		МакетЗагружен = Истина;
		
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не удалось создать COM: '") + ТипПриложения);
	КонецПопытки;
	
КонецПроцедуры // ()

&НаКлиенте
// БИТ_ЖКХ Процедура 
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ЗакрытьCOMОбъект()
	
	Если СОМОбъект = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если ТипПриложения="Word.Application" Тогда
		Попытка
			
			АктивныйДокумент = СОМОбъект.ActiveDocument;
			
			Если НЕ АктивныйДокумент.Saved Тогда
				АктивныйДокумент.Save();
			КонецЕсли;
			
			АктивныйДокумент.Close();
			СОМОбъект.Application.Quit();
			
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не удалось записать и закрыть документ, возможно программа редактирования была закрыта раньше'"));
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры // ()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляТаблицаОбластей

&НаКлиенте
Процедура ТаблицаОбластейПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаОбластей.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		СтруктураПараметров = Новый Структура("ИД", Неопределено);
	Иначе
		СтруктураПараметров = Новый Структура("ИД", ТекущаяСтрока.ИД);
	КонецЕсли; 
	
	Элементы.ТаблицаПараметров.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОбластейМакетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.ТаблицаОбластей.ТекущиеДанные;
	ДанныеВыбора  = СписокМакетов(ТекущаяСтрока.Макет);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОбластейМакетОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.ТаблицаОбластей.ТекущиеДанные;
	ДанныеВыбора  = СписокМакетов(ТекущаяСтрока.Макет);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОбластейПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ТаблицаОбластей.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		УдалитьПоСтроке(ТекущиеДанные.ИД);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОбластейТаблицаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = СписокТабличныхЧастей;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОбластейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОбластейТаблицаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущаяОбласть = Элементы.ТаблицаОбластей.ТекущиеДанные;
	
	Если ТекущаяОбласть = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокПараметров = ТаблицаПараметров.НайтиСтроки(Новый Структура("ИД", ТекущаяОбласть.ИД));
	
	Если НЕ ВыбранноеЗначение = ТекущаяОбласть.Таблица И СписокПараметров.Количество() > 0 Тогда
		
		Ответ = Неопределено;

		
		ПоказатьВопрос(Новый ОписаниеОповещения("ТаблицаОбластейТаблицаОбработкаВыбораЗавершение", ЭтотОбъект, Новый Структура("СписокПараметров, СтандартнаяОбработка", СписокПараметров, СтандартнаяОбработка)), "Таблица параметров будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет); 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОбластейТаблицаОбработкаВыбораЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    СписокПараметров = ДополнительныеПараметры.СписокПараметров;
    СтандартнаяОбработка = ДополнительныеПараметры.СтандартнаяОбработка;
    
    
    Ответ = РезультатВопроса;
    
    Если Ответ = КодВозвратаДиалога.Да Тогда
        
        Для каждого Параметр Из СписокПараметров Цикл
            ТаблицаПараметров.Удалить(Параметр);
        КонецЦикла;
    Иначе
        СтандартнаяОбработка = Ложь;
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОбластейМакетОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущаяОбласть = Элементы.ТаблицаОбластей.ТекущиеДанные;
	
	Если ТекущаяОбласть = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = ПроверитьКолонтитул(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОбластейОбластьОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ПроверитьУникальностьИмени("ТаблицаОбластей",Текст);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляТаблицаПараметров

&НаКлиенте
Процедура ТаблицаПараметровПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущаяОбласть = Элементы.ТаблицаОбластей.ТекущиеДанные;
	
	Если ТекущаяОбласть = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ТекущаяСтрока = Элементы.ТаблицаПараметров.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если НоваяСтрока Тогда
		ТекущаяСтрока.ИД      = ТекущаяОбласть.ИД;
		ТекущаяСтрока.Таблица = ТекущаяОбласть.Таблица;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПараметровПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Копирование;
	
	ТекущаяСтрока = Элементы.ТаблицаОбластей.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено ИЛИ ((ТекущаяСтрока.Макет = "Список" ИЛИ ТекущаяСтрока.Макет = "Таблица") И ПустаяСтрока(ТекущаяСтрока.Таблица)) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПараметровВыражениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяОбласть = Элементы.ТаблицаОбластей.ТекущиеДанные;
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КоллекцияРеквизитов",КоллекцияРеквизитов);
	
	Если НЕ ТекущаяОбласть = Неопределено Тогда
		Если ПустаяСтрока(ТекущаяОбласть.Таблица) Тогда
			ПараметрыФормы.Вставить("ТолькоРеквизиты", Истина);
		Иначе
			ПараметрыФормы.Вставить("Таблица", СокрЛП(ТекущаяОбласть.Таблица));
		КонецЕсли; 
	КонецЕсли; 
	
	ОткрытьФорму("Справочник.бит_ПользовательскиеМакетыПечати.Форма.ФормаВыбораРеквизита", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПараметровВыражениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.ТаблицаПараметров.ТекущиеДанные;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		
		ВыбранноеЗначение.Свойство("Имя"         , ТекущаяСтрока.Выражение);
		ВыбранноеЗначение.Свойство("ИмяРеквизита", ТекущаяСтрока.ИмяРеквизита);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПараметровИмяПараметраОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ТаблицаПараметров.ТекущиеДанные;
	СтандартнаяОбработка = ПроверитьУникальностьИмени("ТаблицаПараметров", Текст,ТекущаяСтрока.ИД);
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура ДобавитьОбласть(Команда)
	
	Если ПроверитьКолонтитул(Команда.Имя) Тогда
		НоваяСтрока = ТаблицаОбластей.Добавить();
		НоваяСтрока.Макет = Команда.Имя;
		НоваяСтрока.ИД    = Новый УникальныйИдентификатор;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбласть(Команда)
	
	ТекущаяСтрока = Элементы.ТаблицаОбластей.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено И НЕ ЗначениеЗаполнено(ТекущаяСтрока.Область) Тогда
		Возврат;
	КонецЕсли;
	
	
	ШаблонТекст = "{v8 Область.%1}";
	
	Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекст, СокрЛП(ТекущаяСтрока.Область));
	
	ВставитьТекстВПозициюКурсораCOMОбъекта(Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьОбласть(Команда)
	
	ТекущаяСтрока = Элементы.ТаблицаОбластей.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено И НЕ ЗначениеЗаполнено(ТекущаяСтрока.Область) Тогда
		Возврат;
	КонецЕсли; 
	
	ШаблонТекст = "{/v8 Область.%1}";
	
	Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекст, СокрЛП(ТекущаяСтрока.Область));
	
	ВставитьТекстВПозициюКурсораCOMОбъекта(Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьПараметр(Команда)
	
	ТекущаяСтрока = Элементы.ТаблицаПараметров.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено И НЕ ЗначениеЗаполнено(ТекущаяСтрока.ИмяПараметра) Тогда
		Возврат;
	КонецЕсли; 
	
	ШаблонТекст = "{v8 %1}";
	
	Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекст, СокрЛП(ТекущаяСтрока.ИмяПараметра));
	
	ВставитьТекстВПозициюКурсораCOMОбъекта(Текст);
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
// БИТ_ЖКХ Процедура 
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ЗапаковатьТаблицы()
	
	АдресТаблицыОбластейВоВременномХранилище = 
		ПоместитьВоВременноеХранилище(бит_ОбщегоНазначения.УпаковатьТаблицуЗначений(ТаблицаОбластей.Выгрузить()), ИдентификаторФормы);
	АдресТаблицыПараметровВоВременномХранилище = 
		ПоместитьВоВременноеХранилище(бит_ОбщегоНазначения.УпаковатьТаблицуЗначений(ТаблицаПараметров.Выгрузить()), ИдентификаторФормы);
	
КонецПроцедуры // ()
	
&НаСервере
// БИТ_ЖКХ Процедура 
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура РаспаковатьТаблицы()
	
	ХранилищеТаблицы = ПолучитьИзВременногоХранилища(АдресТаблицыОбластейВоВременномХранилище);
	
	Таблица = бит_ОбщегоНазначения.РаспаковатьТаблицуЗначений(ХранилищеТаблицы);
	
	Если НЕ Таблица = Неопределено Тогда
		
		ТаблицаОбластей.Очистить();
		ТаблицаОбластей.Загрузить(Таблица);
		
	КонецЕсли;
	
	ХранилищеТаблицы = ПолучитьИзВременногоХранилища(АдресТаблицыПараметровВоВременномХранилище);
	Таблица = бит_ОбщегоНазначения.РаспаковатьТаблицуЗначений(ХранилищеТаблицы);
	
	Если НЕ Таблица = Неопределено Тогда
		
		ТаблицаПараметров.Очистить();
		ТаблицаПараметров.Загрузить(Таблица);
		
	КонецЕсли; 
	
КонецПроцедуры // () 

&НаКлиенте
// БИТ_ЖКХ Функция.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция ПроверитьКолонтитул(Макет)
	
	Если Макет = "ВерхнийКолонтитул" ИЛИ Макет = "НижнийКолонтитул" Тогда
		
	Иначе
		Возврат Истина;
	КонецЕсли; 
	
	Отбор = Новый Структура;
	Отбор.Вставить("Макет", Макет);
	
	Поиск = ТаблицаОбластей.НайтиСтроки(Отбор);
	
	Если Поиск.Количество() > 0 Тогда
		
		ШаблонСообщения = НСтр("ru='Нельзя добавить область с макетом типа %1 более одного раза.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, Макет));
		
		Возврат Ложь;
		
	КонецЕсли; 
	
	Возврат Истина;
	
КонецФункции // ()

&НаКлиенте
// БИТ_ЖКХ Функция.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция ПроверитьУникальностьИмени(ИмяТаблицы, ИмяДляПроверки, ИД = Неопределено)
	
	Отбор = Новый Структура;
	Если ИмяТаблицы = "ТаблицаОбластей" Тогда
		Отбор.Вставить("Область", СокрЛП(ИмяДляПроверки));
	ИначеЕсли ИмяТаблицы = "ТаблицаПараметров" Тогда
		Отбор.Вставить("ИмяПараметра", СокрЛП(ИмяДляПроверки));
	КонецЕсли; 
	
	Если НЕ ИД = Неопределено Тогда
		Отбор.Вставить("ИД", ИД);
	КонецЕсли; 
	
	Поиск = ЭтаФорма[ИмяТаблицы].НайтиСтроки(Отбор);
	
	Если Поиск.Количество() > 0 Тогда
		
		ШаблонСообщения = НСтр("ru='В таблице ""%1"" имя ""%2"" не уникально.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, ИмяТаблицы, ИмяДляПроверки));
		
		Возврат Ложь;
		
	КонецЕсли; 
	
	Возврат Истина;
	
КонецФункции // ()
 
&НаКлиенте
Функция ВставитьТекстВПозициюКурсораCOMОбъекта(Текст)
	
	Результат = ЛОЖЬ;
	
	Если ТипПриложения="Word.Application" Тогда
		
		Попытка
			СОМОбъект.Selection.InsertAfter(Текст);
			Результат = ИСТИНА;
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
// БИТ_ЖКХ Функция.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция СписокМакетов(ТипМакета)
	
	Результат = Новый СписокЗначений;
	
	Если ТипМакета = "Таблица" ИЛИ ТипМакета = "Список" Тогда
		
		Результат.Добавить("Таблица"          , "Таблица (строка таблицы)");
		Результат.Добавить("Список"           , "Список (строка таблицы)");
		
	Иначе
		
		Результат.Добавить("ВерхнийКолонтитул", "Верхний колонтитул");
		Результат.Добавить("НижнийКолонтитул" , "Нижний колонтитул");
		//Результат.Добавить("Заголовок"        , "Заголовок");
		Результат.Добавить("Реквизиты"        , "Реквизиты");
		
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции // ()

#КонецОбласти
